/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"AddCredentials.Consent.FinancialInformation" = "%@ kommer att få dina ekonomiska uppgifter. Läs mer";

/* Title of the Privacy Policy link. This has to match the mention of the Privacy Policy in the `AddCredentials.Consent.ServiceAgreement` string. */
"AddCredentials.Consent.PrivacyPolicy" = "Integritetspolicy";

/* Title of the link to more information. This has to match the text for link in the `AddCredentials.Consent.FinancialInformation` string. */
"AddCredentials.Consent.ReadMore" = "Läs mer";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"AddCredentials.Consent.ServiceAgreement" = "Genom att använda tjänsten godkänner du Tinks Användarvillkor och Integritetspolicy";

/* Title of the Privacy Policy link. This has to match the mention of the Terms and Conditions in the `AddCredentials.Consent.ServiceAgreement` string. */
"AddCredentials.Consent.TermsAndConditions" = "Användarvillkor";

/* Title for action to continue adding credentials. */
"AddCredentials.Discard.ContinueAction" = "Fortsätt redigera";

/* Title for action to discard adding credentials. */
"AddCredentials.Discard.PrimaryAction" = "Lägg inte till";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"AddCredentials.Discard.Title" = "Är du säker på att du inte vill lägga till den här anslutningen?";

/* Title for error shown when authentication failed while adding credentials. */
"AddCredentials.Error.AuthenticationFailed" = "Autentiseringen misslyckades";

/* Title for error shown when credentials already exists. */
"AddCredentials.Error.CredentialsAlreadyExists" = "Ett fel inträffade";

/* Message for error shown when credentials already exists. */
"AddCredentials.Error.CredentialsAlreadyExists.FailureReason" = "Du har redan en anslutning till den här banken.";

/* Title for error shown when a permanent failure occured while adding credentials. */
"AddCredentials.Error.PermanentFailure" = "Permanent fel";

/* Title for error shown when a temporary failure occured while adding credentials. */
"AddCredentials.Error.TemporaryFailure" = "Tillfälligt fel";

/* Title for button to start authenticating credentials. */
"AddCredentials.Form.Continue" = "Fortsätt";

/* Title for button to open BankID app. */
"AddCredentials.Form.OpenBankID" = "Öppna BankID";

/* Title for screen where user fills in form to add credentials. */
"AddCredentials.Form.Title" = "Autentisera";

/* Text introducing the descriptions for which data points will be collected when using the service. */
"AddCredentials.ScopeDescriptions.Body" = "Genom att använda denna tjänst samlar vi in finansuppgifter om dig. Vi samlar in följande datapunkter:";

/* Title for text introducing the descriptions for which data points will be collected when using the service. */
"AddCredentials.ScopeDescriptions.Title" = "Vi samlar in följande datapunkter från dig.";

/* Text shown when adding credentials and waiting for authorization. */
"AddCredentials.Status.Authorizing" = "Autentiserar…";

/* Title for button to cancel an ongoing task for adding credentials. */
"AddCredentials.Status.Cancel" = "Avbryt";

/* Text shown when canceling supplementing information. */
"AddCredentials.Status.Canceling" = "Avbryter…";

/* Text shown when submitting supplemental information. */
"AddCredentials.Status.Sending" = "Skickar…";

/* Text shown when updating credentials. */
"AddCredentials.Status.Updating" = "Ansluter ditt konto till %@, vänligen vänta…";

/* Fallback text shown when fail to get bank name while updating credentials. */
"AddCredentials.Status.Updating.Fallback" = "Ansluter ditt konto, vänligen vänta…";

/* Text shown when adding credentials and waiting for authenticvation on another device. */
"AddCredentials.Status.WaitingForAuthenticationOnAnotherDevice" = "Väntar på autentisering på en annan enhet";

/* Title for button to dismiss the screen shown when credentials were added successfully. */
"AddCredentials.Success.Confirm" = "Klar";

/* Subtitle for screen shown when credentials were added successfully. */
"AddCredentials.Success.Subtitle" = "Ditt konto har anslutits till %@.";

/* Title for screen shown when credentials were added successfully. */
"AddCredentials.Success.Title" = "Anslutningen lyckades";

/* Text for the warning shown when the developer is unverified. */
"AddCredentials.Warning.UnverifiedClient" = "Overifierad - Den här lösningen är endast gjord i utvecklingssyfte. Ange inte dina inloggningsuppgifter om du inte litar på utvecklaren.";

/* Title for action to dismiss error alert. */
"Generic.Alert.Dismiss" = "Stäng";

/* Title for action to confirm alert. */
"Generic.Alert.OK" = "OK";

/* Title generic alert. */
"Generic.Alert.Title" = "Ett fel inträffade";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "Tjänsten är inte tillgänglig just nu.";

/* Title for action to retry a failed request. */
"Generic.ServiceAlert.Retry" = "Försök igen";

/* Text describing the group of providers that use Open Banking. */
"ProviderPicker.AccessType.OpenBankingDetail" = "Innefattar vardagskonton, exempelvis ditt lönekonto.";

/* Title for the group of providers that use Open Banking. */
"ProviderPicker.AccessType.OpenBankingTitle" = "Transaktionskonton";

/* Text describing the group of providers that does not use Open Banking. */
"ProviderPicker.AccessType.OtherDetail" = "Innefattar sparkonton, kreditkort, lån, investeringar och personuppgifter";

/* Title for the group of providers that does not use Open Banking. */
"ProviderPicker.AccessType.OtherTitle" = "Andra kontotyper";

/* Description for error when providers could not be loaded. */
"ProviderPicker.Error.Description" = "Vi har blivit informerade om det här felet och jobbar på att lösa det. Bear with us, and try again a bit later.";

/* Title for button to try loading providers again. */
"ProviderPicker.Error.RetryButton" = "Försök igen";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderPicker.Error.Temporary" = "Det här kan vara ett tillfälligt fel, försök igen senare.";

/* Title for when providers could not be loaded. */
"ProviderPicker.Error.Title" = "Inga banker hittades";

/* Title for screen where user selects which access type to use when adding credentials. */
"ProviderPicker.List.AccessTypeTitle" = "Lägg till %@";

/* Title for screen where user selects which authentication type to use when adding credentials. */
"ProviderPicker.List.CredentialsTypeTitle" = "Inloggningsmetod";

/* Title for list of all providers. */
"ProviderPicker.List.FinancialInstitutionsTitle" = "Välj bank";

/* Placeholder in search field shown in provider list. */
"ProviderPicker.List.SearchPlaceholder" = "Sök efter banker eller kort";

/* Title for button to send supplemental information when adding credentials. */
"SupplementalInformation.Form.Submit" = "Skicka";

/* Title for form asking user to supplement information when adding credentials. */
"SupplementalInformation.Form.Title" = "Tilläggsinformation";

/* Title for action to cancel downloading app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Cancel" = "Avbryt";

/* Title for action to confirm alert requesting download of third-party authentication app when AppStore URL could not be opened. */
"ThirdPartyAppAuthentication.DownloadAlert.Dismiss" = "OK";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Ladda ner";

